[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
？
！
。
，
1
2
5
8
9
11
14
16
17
18
19
20
21
22
25
26
27
29
31
32
34
35
36
37
39
40
41
42
44
46
47
48
49
50
52
53
54
55
56
57
58
59
60
63
64
65
66
67
68
70
71
72
75
76
77
78
80
81
83
84
85
86
87
88
89
90
92
93
94
95
97
98
99
100
101
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
120
125
126
127
128
129
130
131
132
133
134
135
136
137
139
140
141
142
143
144
146
147
148
149
150
153
155
156
157
158
161
162
165
166
169
170
172
173
174
175
176
177
178
181
182
183
184
185
186
189
190
191
193
197
199
200
201
203
204
205
208
209
211
212
213
214
215
216
218
220
221
222
224
226
227
228
229
230
231
233
235
236
239
240
241
242
243
244
245
247
248
249
250
253
254
255
257
259
261
262
263
264
266
267
268
269
270
272
273
274
275
276
277
279
281
282
284
285
287
289
290
294
295
296
300
303
304
309
310
311
312
313
315
317
321
322
323
324
325
333
335
336
339
341
342
343
344
345
346
347
348
351
352
355
356
358
359
362
363
365
368
369
370
371
373
375
377
378
379
380
382
383
386
387
388
389
390
391
392
393
394
396
397
398
399
400
401
402
403
404
405
407
408
410
412
413
414
415
416
417
419
420
424
425
430
432
433
434
436
437
438
439
440
441
443
444
446
447
448
449
450
451
452
454
455
457
458
459
460
461
463
464
465
467
469
470
471
472
473
475
476
478
479
480
482
484
485
487
488
489
490
491
492
493
494
497
498
500
503
505
507
508
509
511
513
516
517
521
522
524
525
526
527
529
530
532
534
535
536
537
538
539
541
542
544
547
548
549
550
551
553
555
556
557
559
560
561
563
564
565
566
567
568
569
570
571
572
573
574
575
577
578
579
580
581
582
584
585
587
589
590
591
592
594
596
598
599
601
602
603
604
605
607
609
610
611
612
614
615
616
617
619
620
621
622
623
624
625
626
627
629
630
633
634
636
639
640
641
642
644
645
647
648
649
651
652
654
656
657
658
659
661
664
665
666
667
669
670
672
673
674
675
676
677
678
679
681
682
683
684
686
687
688
689
691
692
693
694
697
698
700
701
702
703
704
705
708
709
710
711
712
714
715
717
719
720
721
722
723
724
725
726
728
729
730
731
733
734
735
737
739
741
742
743
744
745
749
750
751
752
753
755
756
757
758
759
760
761
763
765
766
768
769
772
774
775
777
779
781
782
783
784
786
787
788
789
790
792
793
794
797
799
800
802
803
804
805
806
807
808
809
810
816
817
818
819
820
823
824
825
826
827
831
832
834
835
836
838
839
840
841
843
846
847
853
854
858
859
860
861
862
863
865
868
869
870
873
876
879
881
882
883
884
886
887
888
891
893
894
895
896
897
899
901
902
903
904
907
908
909
910
911
912
913
914
916
918
919
920
921
922
924
925
926
927
928
929
930
931
932
933
936
937
939
941
942
943
944
945
946
947
948
949
951
952
953
954
956
957
958
959
960
961
962
964
969
971
972
973
974
975
976
977
978
979
980
981
982
983
986
989
990
991
994
996
998
1001
1004
1005
1007
1008
1009
1010
1012
1013
1015
1016
1017
1020
1021
1022
1024
1025
1026
1027
1028
1029
1030
1032
1033
1034
1036
1038
1040
1042
1045
1046
1047
1048
1050
1051
1052
1053
1056
1058
1059
1061
1062
1063
1064
1065
1066
1067
1068
1069
1070
1071
1075
1076
1079
1080
1081
1082
1085
1087
1089
1091
1092
1093
1095
1096
1097
1098
1099
1100
1101
1102
1104
1105
1106
1107
1109
1111
1112
1113
1115
1116
1117
1119
1120
1121
1122
1124
1126
1128
1130
1131
1134
1138
1139
1140
1141
1142
1143
1144
1146
1149
1151
1152
1154
1155
1156
1157
1159
1160
1161
1162
1163
1164
1167
1168
1170
1176
1178
1179
1181
1182
1183
1184
1185
1189
1190
1191
1192
1193
1195
1197
1198
1199
1200
1201
1202
1204
1206
1207
1211
1212
1214
1215
1216
1217
1218
1221
1222
1223
1224
1225
1227
1228
1230
1231
1232
1233
1234
1236
1237
1238
1239
1242
1243
1245
1246
1247
1248
1249
1251
1252
1253
1254
1255
1257
1258
1260
1261
1262
1263
1264
1265
1266
1268
1271
1274
1275
1277
1278
1279
1280
1281
1282
1283
1284
1285
1287
1288
1289
1291
1292
1295
1296
1298
1299
1300
1301
1302
1304
1305
1306
1307
1308
1310
1311
1313
1315
1316
1317
1318
1319
1320
1321
1322
1323
1324
1330
1331
1332
1333
1334
1335
1336
1337
1338
1339
1340
1341
1342
1343
1344
1348
1349
1351
1352
1353
1355
1356
1357
1361
1362
1363
1364
1365
1367
1368
1369
1370
1371
1372
1373
1374
1377
1378
1379
1380
1381
1382
1385
1387
1388
1389
1390
1391
1392
1394
1395
1396
1397
1398
1400
1403
1405
1406
1407
1408
1410
1411
1412
1413
1414
1415
1416
1418
1422
1423
1424
1426
1428
1429
1432
1433
1434
1435
1438
1439
1440
1441
1443
1444
1445
1446
1448
1449
1450
1451
1453
1454
1456
1457
1458
1459
1462
1463
1464
1465
1466
1467
1469
1472
1473
1477
1478
1481
1482
1483
1484
1485
1487
1489
1490
1491
1494
1495
1496
1497
1499
1501
1502
1503
1504
1506
1507
1511
1512
1513
1514
1516
1518
1520
1521
1523
1524
1525
1528
1529
1530
1531
1533
1535
1537
1539
1540
1542
1543
1544
1545
1546
1548
1549
1550
1552
1554
1557
1558
1560
1562
1563
1564
1565
1566
1567
1570
1572
1573
1575
1576
1577
1578
1579
1580
1581
1582
1584
1585
1586
1587
1588
1590
1591
1592
1593
1595
1596
1597
1598
1599
1600
1602
1604
1605
1606
1607
1608
1609
1610
1613
1614
1615
1616
1617
1619
1621
1622
1623
1624
1626
1627
1629
1630
1631
1632
1633
1634
1636
1637
1638
1640
1641
1642
1643
1644
1645
1646
1647
1648
1649
1650
1654
1658
1659
1660
1662
1667
1669
1670
1672
1673
1675
1677
1678
1679
1680
1684
1686
1688
1692
1693
1696
1697
1700
1701
1703
1704
1705
1706
1707
1709
1711
1712
1713
1714
1715
1716
1717
1718
1719
1720
1721
1722
1723
1725
1726
1727
1728
1729
1730
1731
1733
1734
1735
1738
1739
1742
1744
1745
1746
1747
1752
1753
1756
1757
1758
1761
1762
1763
1764
1765
1767
1768
1770
1772
1773
1774
1775
1776
1777
1778
1779
1780
1781
1782
1784
1785
1786
1787
1788
1789
1792
1793
1795
1796
1797
1799
1800
1801
1803
1804
1806
1807
1809
1810
1811
1812
1813
1815
1817
1818
1819
1820
1823
1824
1826
1827
1828
1829
1833
1834
1835
1836
1838
1839
1840
1841
1843
1845
1847
1848
1849
1850
1854
1855
1856
1858
1861
1862
1863
1864
1865
1866
1868
1869
1870
1871
1873
1875
1878
1879
1880
1881
1882
1883
1885
1886
1887
1889
1890
1891
1893
1894
1895
1896
1897
1899
1900
1901
1902
1903
1905
1906
1907
1908
1910
1912
1913
1915
1916
1917
1918
1919
1921
1922
1923
1925
1927
1928
1929
1931
1932
1933
1934
1935
1936
1938
1939
1940
1941
1942
1943
1944
1945
1946
1947
1948
1950
1951
1954
1955
1957
1958
1960
1962
1965
1966
1968
1971
1973
1974
1976
1979
1980
1982
1983
1984
1985
1987
1988
1989
1990
1991
1994
1995
1997
1998
2000
2001
2002
2004
2005
2007
2008
2009
2012
2015
2016
2019
2020
2022
2023
2024
2027
2029
2030
2031
2032
2033
2034
2038
2039
2040
2041
2042
2043
2046
2047
2048
2052
2054
2055
2056
2057
2059
2060
2061
2062
2063
2064
2066
2068
2069
2071
2072
2073
2078
2079
2080
2081
2082
2084
2085
2086
2087
2089
2090
2091
2092
2093
2094
2097
2099
2101
2102
2103
2104
2106
2107
2108
2109
2110
2113
2114
2115
2116
2117
2118
2119
2122
2124
2125
2129
2131
2132
2133
2134
2135
2136
2137
2138
2139
2140
2141
2142
2143
2145
2146
2147
2148
2149
2150
2152
2153
2154
2155
2156
2157
2159
2160
2161
2162
2163
2165
2166
2167
2168
2169
2170
2171
2172
2173
2174
2175
2176
2177
2179
2180
2181
2184
2185
2186
2187
2188
2189
2191
2192
2194
2198
2199
2200
2201
2202
2203
2206
2207
2209
2210
2212
2213
2215
2216
2217
2218
2219
2220
2221
2222
2224
2226
2228
2232
2233
2234
2238
2240
2241
2243
2245
2246
2247
2250
2251
2252
2254
2256
2260
2262
2263
2264
2265
2266
2267
2268
2269
2271
2274
2275
2276
2277
2280
2281
2283
2286
2289
2290
2292
2293
2294
2295
2296
2297
2298
2299
2300
2301
2302
2303
2304
2307
2308
2309
2311
2312
2313
2314
2316
2317
2319
2322
2324
2325
2327
2328
2329
2330
2331
2333
2334
2336
2337
2338
2339
2340
2341
2342
2343
2344
2347
2348
2349
2350
2351
2352
2353
2354
2356
2357
2358
2359
2360
2362
2363
2365
2367
2368
2372
2373
2374
2375
2376
2377
2378
2379
2380
2381
2385
2386
2387
2388
2390
2391
2394
2395
2396
2397
2398
2399
2400
2401
2402
2405
2406
2407
2408
2409
2410
2411
2412
2414
2415
2416
2417
2418
2419
2421
2422
2423
2424
2425
2428
2429
2430
2431
2432
2433
2434
2436
2438
2439
2442
2443
2446
2447
2450
2451
2452
2454
2455
2457
2461
2465
2466
2467
2468
2473
2478
2479
2480
2481
2483
2484
2485
2486
2487
2488
2489
2492
2493
2494
2496
2497
2498
2499
2500
2501
2502
2503
2506
2508
2509
2511
2512
2514
2516
2518
2523
2524
2526
2531
2532
2533
2537
2538
2540
2543
2545
2547
2548
2550
2551
2552
2553
2554
2555
2556
2557
2558
2561
2563
2566
2567
2568
2570
2571
2572
2573
2574
2576
2577
2578
2579
2580
2581
2585
2588
2589
2590
2591
2592
2593
2597
2598
2599
2600
2601
2602
2603
2604
2608
2609
2610
2611
2612
2617
2618
2619
2620
2621
2622
2624
2625
2628
2629
2630
2631
2632
2633
2634
2636
2637
2638
2639
2640
2643
2644
2646
2647
2648
2649
2651
2652
2653
2654
2656
2657
2658
2660
2661
2662
2663
2664
2666
2668
2669
2671
2672
2673
2674
2675
2677
2679
2680
2683
2685
2686
2687
2688
2689
2690
2691
2693
2694
2695
2696
2698
2700
2701
2705
2706
2707
2708
2709
2711
2712
2713
2714
2715
2716
2717
2720
2721
2722
2723
2726
2729
2731
2732
2733
2735
2736
2738
2739
2740
2741
2744
2745
2747
2749
2750
2751
2753
2754
2756
2757
2758
2760
2762
2763
2764
2765
2766
2767
2769
2770
2771
2773
2774
2775
2776
2781
2782
2783
2787
2789
2790
2793
2794
2796
2797
2798
2799
2800
2802
2804
2806
2807
2808
2810
2811
2813
2814
2815
2816
2817
2819
2820
2821
2823
2825
2826
2828
2829
2830
2832
2834
2836
2838
2839
2841
2845
2846
2849
2850
2853
2854
2855
2856
2857
2858
2859
2861
2862
2863
2864
2865
2867
2868
2869
2870
2873
2875
2876
2877
2878
2880
2881
2882
2883
2884
2890
2892
2893
2894
2895
2896
2897
2898
2899
2901
2903
2906
2908
2909
2910
2911
2913
2914
2915
2919
2920
2921
2922
2926
2929
2930
2931
2932
2934
2935
2936
2937
2938
2939
2940
2941
2943
2944
2945
2946
2947
2948
2949
2950
2951
2954
2956
2957
2958
2959
2960
2961
2962
2963
2965
2967
2968
2969
2970
2971
2973
2974
2975
2976
2977
2980
2984
2985
2987
2989
2990
2991
2992
2993
2994
2995
2997
2998
2999
3000
3001
3004
3007
3008
3009
3010
3011
3014
3015
3016
3017
3018
3019
3020
3021
3022
3023
3024
3025
3028
3029
3030
3031
3033
3034
3035
3036
3037
3038
3039
3042
3043
3044
3045
3046
3047
3048
3049
3050
3051
3052
3053
3054
3055
3056
3057
3059
3060
3061
3062
3063
3064
3066
3067
3068
3069
3070
3071
3072
3073
3074
3075
3076
3077
3080
3082
3083
3084
3085
3086
3087
3088
3089
3091
3092
3094
3095
3097
3098
3099
3103
3105
3106
3108
3109
3110
3112
3113
3114
3116
3117
3121
3122
3125
3126
3127
3128
3129
3130
3131
3132
3133
3134
3136
3138
3140
3141
3142
3143
3144
3145
3146
3147
3148
3149
3151
3152
3154
3155
3157
3158
3159
3160
3161
3163
3164
3165
3166
3167
3168
3170
3171
3173
3174
3175
3177
3178
3179
3180
3181
3182
3183
3184
3187
3188
3191
3192
3194
3195
3196
3197
3198
3200
3201
3202
3203
3206
3208
3209
3210
3211
3213
3214
3215
3216
3217
3218
3221
3224
3225
3226
3227
3228
3229
3231
3236
3238
3239
3240
3241
3242
3244
3245
3246
3247
3248
3249
3251
3252
3253
3254
3255
3256
3258
3259
3260
3261
3262
3263
3264
3265
3266
3267
3268
3269
3270
3271
3272
3273
3274
3275
3276
3279
3280
3281
3282
3283
3284
3285
3286
3288
3290
3291
3292
3293
3294
3295
3297
3299
3302
3303
3304
3305
3306
3307
3308
3311
3312
3313
3314
3315
3316
3317
3318
3319
3321
3323
3324
3325
3326
3327
3328
3329
3330
3332
3333
3334
3335
3337
3340
3341
3342
3343
3344
3345
3346
3350
3351
3352
3353
3355
3356
3357
3358
3359
3360
3362
3363
3364
3365
3366
3368
3369
3370
3371
3372
3373
3376
3377
3378
3381
3382
3384
3385
3387
3388
3389
3390
3392
3393
3395
3396
3398
3399
3400
3402
3403
3404
3405
3406
3407
3408
3409
3410
3412
3414
3415
3416
3418
3419
3420
3421
3422
3423
3424
3425
3426
3427
3430
3431
3432
3433
3434
3436
3438
3440
3441
3442
3443
3445
3447
3449
3450
3452
3453
3454
3455
3457
3458
3462
3463
3464
3465
3466
3467
3468
3469
3470
3471
3472
3473
3475
3477
3479
3481
3482
3484
3485
3489
3490
3492
3494
3495
3496
3497
3498
3499
3500
3501
3502
3504
3507
3508
3509
3513
3514
3515
3517
3518
3519
3520
3521
3522
3523
3524
3526
3529
3533
3534
3539
3540
3545
3547
3549
3550
3551
3552
3553
3554
3558
3559
3560
3561
3562
3564
3565
3567
3568
3569
3571
3573
3576
3577
3578
3582
3583
3585
3587
3588
3590
3591
3592
3593
3595
3596
3598
3599
3600
3601
3602
3603
3604
3605
3607
3610
3611
3613
3617
3618
3619
3621
3623
3624
3627
3630
3631
3633
3635
3636
3637
3639
3640
3642
3644
3645
3647
3651
3652
3654
3655
3656
3658
3659
3660
3661
3662
3664
3665
3668
3669
3670
3672
3673
3674
3676
3681
3682
3684
3685
3686
3687
3688
3689
3690
3691
3693
3695
3696
3699
3701
3702
3704
3705
3706
3707
3708
3712
3714
3716
3717
3719
3720
3721
3722
3723
3724
3725
3727
3728
3729
3730
3731
3732
3734
3735
3736
3737
3739
3742
3743
3744
3745
3746
3748
3749
3750
3751
3752
3753
3755
3756
3757
3760
3761
3763
3764
3767
3768
3770
3773
3775
3777
3778
3779
3780
3781
3782
3783
3784
3785
3787
3788
3789
3790
3791
3792
3793
3794
3795
3796
3798
3799
3800
3802
3803
3804
3807
3809
3810
3812
3813
3815
3816
3819
3820
3822
3823
3824
3826
3827
3828
3829
3830
3832
3833
3834
3835
3838
3839
3840
3841
3842
3843
3844
3845
3846
3848
3850
3852
3854
3855
3857
3858
3859
3860
3862
3863
3864
3866
3867
3868
3870
3871
3872
3873
3875
3876
3877
3879
3880
3881
3883
3885
3886
3888
3889
3890
3891
3894
3895
3897
3898
3899
3901
3902
3904
3905
3907
3908
3909
3910
3911
3912
3913
3914
3915
3916
3917
3918
3919
3921
3923
3924
3925
3926
3927
3928
3930
3931
3933
3934
3937
3938
3939
3940
3941
3942
3943
3944
3947
3948
3949
3952
3953
3954
3955
3956
3957
3959
3961
3963
3964
3967
3970
3972
3973
3974
3975
3977
3980
3982
3985
3990
3991
3993
3994
3995
3996
3998
4000
4001
4003
4004
4005
4006
4007
4010
4012
4013
4014
4015
4016
4017
4018
4019
4022
4024
4026
4030
4031
4036
4037
4038
4039
4040
4041
4042
4043
4044
4045
4047
4048
4049
4050
4053
4054
4055
4060
4061
4062
4065
4066
4069
4071
4075
4077
4078
4079
4080
4082
4083
4085
4087
4090
4091
4092
4093
4094
4095
4096
4097
4098
4104
4105
4106
4107
4109
4110
4111
4113
4114
4116
4117
4119
4120
4121
4122
4123
4124
4125
4126
4127
4128
4130
4131
4132
4133
4135
4137
4138
4139
4140
4141
4142
4143
4147
4153
4155
4156
4158
4159
4160
4161
4162
4164
4165
4166
4167
4168
4169
4171
4172
4173
4174
4175
4176
4179
4180
4181
4182
4184
4185
4186
4187
4188
4189
4190
4191
4193
4196
4197
4198
4199
4200
4202
4204
4205
4207
4208
4209
4211
4212
4213
4214
4215
4217
4219
4220
4222
4224
4225
4226
4227
4230
4231
4232
4234
4235
4236
4238
4240
4243
4245
4247
4249
4251
4253
4255
4256
4259
4260
4262
4263
4264
4265
4266
4271
4272
4273
4274
4275
4276
4277
4278
4279
4280
4282
4285
4286
4288
4289
4290
4291
4293
4295
4298
4299
4302
4303
4304
4305
4306
4308
4309
4311
4312
4313
4314
4315
4316
4317
4318
4320
4321
4322
4323
4324
4325
4328
4330
4332
4333
4334
4335
4337
4338
4339
4340
4342
4343
4344
4345
4346
4347
4348
4351
4352
4353
4355
4356
4358
4360
4361
4363
4364
4365
4366
4367
4368
4370
4371
4373
4375
4376
4378
4379
4380
4382
4383
4384
4385
4386
4388
4390
4391
4394
4395
4396
4397
4398
4400
4403
4404
4406
4407
4408
4409
4411
4412
4413
4415
4416
4418
4421
4422
4426
4427
4428
4429
4430
4431
4432
4433
4434
4435
4436
4437
4438
4439
4440
4441
4442
4444
4445
4446
4450
4452
4454
4455
4456
4457
4460
4461
4462
4464
4465
4466
4467
4469
4470
4471
4472
4473
4474
4475
4476
4477
4478
4479
4480
4481
4482
4483
4484
4485
4487
4488
4489
4490
4491
4492
4493
4495
4496
4497
4498
4500
4502
4503
4504
4506
4507
4509
4510
4512
4513
4515
4516
4517
4518
4519
4520
4522
4524
4525
4526
4527
4528
4529
4530
4531
4532
4534
4535
4536
4537
4538
4541
4542
4544
4546
4547
4548
4549
4550
4556
4557
4558
4559
4560
4561
4566
4567
4569
4570
4571
4572
4573
4574
4575
4577
4578
4581
4582
4583
4585
4586
4587
4588
4589
4591
4592
4595
4597
4600
4601
4602
4603
4604
4605
4607
4608
4609
4613
4615
4616
4617
4619
4620
4621
4623
4624
4625
4628
4629
4630
4631
4632
4634
4635
4636
4638
4639
4641
4642
4644
4646
4648
4649
4651
4652
4654
4655
4656
4657
4659
4661
4663
4667
4668
4670
4671
4672
4673
4674
4676
4677
4678
4682
4683
4684
4685
4686
4687
4688
4693
4694
4696
4697
4698
4699
4700
4701
4702
4703
4704
4705
4706
4707
4708
4710
4712
4713
4714
4715
4716
4718
4719
4720
4721
4722
4723
4724
4725
4726
4727
4728
4731
4740
4741
4742
4743
4744
4745
4747
4751
4752
4753
4754
4756
4757
4759
4760
4762
4764
4765
4767
4768
4769
4770
4772
4774
4775
4777
4778
4779
4780
4785
4786
4788
4789
4791
4792
4795
4796
4797
4798
4799
4800
4801
4804
4805
4806
4807
4808
4809
4811
4813
4814
4815
4816
4819
4820
4822
4825
4826
4827
4830
4831
4832
4834
4835
4836
4837
4838
4839
4841
4842
4843
4844
4845
4846
4847
4848
4849
4852
4854
4855
4856
4857
4858
4859
4860
4861
4862
4863
4864
4866
4867
4869
4871
4873
4874
4875
4876
4877
4879
4880
4881
4882
4883
4884
4885
4886
4887
4888
4889
4890
4892
4896
4897
4898
4899
4900
4901
4905
4906
4907
4910
4912
4914
4915
4916
4917
4920
4924
4925
4926
4928
4929
4930
4931
4932
4934
4935
4936
4938
4939
4940
4941
4942
4944
4945
4947
4948
4949
4950
4952
4953
4955
4958
4959
4962
4963
4964
4965
4966
4967
4969
4970
4971
4972
4973
4975
4976
4977
4979
4980
4981
4982
4983
4984
4985
4988
4990
4992
4994
4995
4996
4997
4999
5000
5001
5003
5004
5005
5006
5008
5012
5013
5014
5015
5016
5020
5021
5022
5024
5025
5026
5029
5030
5032
5034
5037
5038
5039
5040
5041
5043
5044
5046
5047
5048
5049
5050
5051
5052
5053
5054
5058
5060
5061
5062
5064
5065
5066
5067
5068
5070
5071
5072
5073
5076
5077
5078
5079
5080
5081
5083
5084
5086
5088
5089
5091
5093
5094
5095
5096
5097
5099
5100
5101
5102
5104
5107
5108
5109
5110
5111
5112
5113
5114
5115
5116
5117
5118
5119
5120
5121
5122
5123
5124
5125
5126
5127
5129
5131
5133
5135
5136
5137
5138
5140
5141
5142
5144
5145
5146
5150
5152
5153
5155
5161
5162
5164
5165
5166
5167
5169
5170
5174
5176
5178
5179
5180
5181
5182
5185
5186
5187
5188
5189
5190
5191
5192
5193
5194
5195
5196
5197
5198
5199
5200
5201
5202
5203
5206
5209
5210
5211
5212
5213
5214
5215
5216
5218
5219
5220
5221
5222
5223
5224
5227
5229
5231
5232
5233
5235
5237
5238
5239
5240
5241
5243
5244
5245
5246
5247
5248
5249
5250
5251
5252
5253
5254
5255
5256
5257
5259
5262
5263
5265
5268
5270
5271
5272
5273
5276
5277
5280
5281
5283
5284
5285
5286
5288
5289
5290
5292
5293
5295
5296
5297
5298
5299
5300
5301
5302
5304
5306
5307
5308
5310
5312
5313
5314
5315
5316
5317
5318
5319
5320
5321
5322
5323
5324
5326
5328
5329
5330
5331
5334
5335
5336
5340
5341
5342
5344
5346
5347
5348
5349
5350
5351
5352
5353
5354
5355
5356
5357
5358
5359
5362
5363
5365
5367
5368
5369
5371
5373
5374
5375
5376
5377
5378
5379
5382
5383
5384
5385
5386
5390
5393
5394
5396
5397
5398
5399
5401
5402
5404
5407
5408
5409
5410
5411
5413
5414
5415
5416
5417
5418
5420
5421
5423
5424
5425
5428
5429
5430
5431
5432
5433
5436
5438
5439
5440
5442
5444
5446
5447
5449
5451
5452
5453
5454
5455
5456
5457
5458
5459
5460
5463
5465
5466
5467
5469
5470
5473
5475
5476
5480
5481
5482
5483
5484
5486
5489
5490
5495
5496
5497
5498
5501
5502
5503
5504
5506
5507
5509
5510
5512
5514
5517
5518
5520
5521
5522
5523
5524
5526
5527
5528
5530
5531
5532
5533
5534
5535
5536
5537
5538
5539
5540
5541
5542
5545
5548
5549
5550
5551
5552
5554
5555
5556
5558
5560
5562
5564
5565
5567
5569
5571
5573
5574
5577
5580
5582
5585
5587
5588
5589
5592
5594
5596
5597
5598
5600
5602
5603
5604
5608
5609
5613
5616
5617
5619
5620
5621
5622
5625
5627
5629
5630
5632
5635
5637
5638
5639
5640
5641
5642
5643
5644
5645
5646
5649
5650
5652
5653
5654
5655
5656
5657
5658
5659
5660
5661
5662
5663
5664
5666
5667
5669
5671
5672
5673
5674
5675
5676
5677
5678
5679
5680
5681
5682
5683
5684
5685
5686
5687
5689
5691
5693
5694
5697
5699
5700
5702
5703
5704
5705
5706
5708
5709
5710
5713
5714
5717
5718
5719
5720
5721
5722
5723
5725
5726
5727
5728
5729
5730
5732
5734
5735
5736
5737
5738
5739
5740
5741
5742
5743
5745
5748
5749
5750
5751
5752
5755
5756
5757
5758
5763
5764
5765
5766
5767
5768
5770
5772
5773
5774
5775
5776
5779
5780
5781
5784
5787
5788
5789
5790
5791
5792
5794
5795
5798
5799
5800
5801
5802
5805
5806
5808
5809
5811
5814
5817
5819
5820
5821
5822
5823
5824
5826
5828
5831
5832
5833
5834
5835
5836
5837
5838
5839
5840
5841
5842
5844
5845
5846
5847
5851
5853
5854
5856
5858
5861
5863
5865
5867
5868
5870
5871
5872
5874
5875
5876
5877
5878
5879
5880
5881
5882
5883
5884
5885
5886
5887
5889
5890
5891
5895
5896
5897
5898
5899
5901
5903
5904
5905
5906
5907
5908
5910
5912
5913
5914
5917
5920
5921
5924
5926
5928
5929
5930
5931
5932
5933
5934
5937
5938
5939
5940
5941
5943
5944
5945
5946
5947
5948
5949
5950
5951
5952
5953
5954
5956
5957
5958
5959
5962
5964
5965
5967
5968
5969
5970
5972
5975
5976
5977
5978
5979
5980
5981
5982
5983
5984
5985
5986
5987
5991
5993
5994
5995
5996
5997
6000
6001
6002
6004
6005
6006
6008
6011
6016
6018
6019
6020
6021
6023
6026
6028
6029
6030
6031
6032
6033
6034
6035
6036
6037
6038
6039
6040
6042
6043
6044
6046
6047
6048
6049
6051
6053
6054
6056
6057
6060
6061
6062
6063
6066
6067
6068
6071
6073
6074
6076
6077
6078
6079
6081
6082
6083
6084
6085
6086
6087
6090
6091
6092
6093
6094
6095
6097
6098
6101
6102
6105
6106
6108
6109
6110
6113
6114
6117
6118
6120
6122
6123
6125
6127
6128
6129
6130
6133
6134
6135
6136
6137
6138
6141
6142
6143
6144
6146
6147
6148
6149
6150
6152
6155
6156
6157
6158
6159
6160
6161
6162
6163
6164
6166
6167
6168
6170
6171
6172
6174
6176
6177
6178
6179
6180
6182
6184
6185
6186
6187
6189
6191
6192
6195
6196
6197
6199
6200
6201
6203
6205
6206
6207
6208
6209
6210
6211
6213
6214
6217
6219
6220
6221
6222
6223
6224
6225
6228
6230
6231
6232
6233
6234
6236
6238
6239
6240
6242
6243
6244
6247
6248
6250
6251
6253
6254
6256
6257
6258
6259
6260
6261
6262
6263
6265
6266
6268
6269
6270
6271
6272
6273
6274
6276
6277
6278
6279
6280
6281
6283
6284
6285
6286
6287
6288
6289
6291
6292
6293
6294
6298
6302
6303
6305
6306
6307
6308
6309
6310
6312
6313
6315
6316
6317
6318
6319
6323
6325
6327
6328
6330
6332
6333
6334
6336
6337
6342
6345
6346
6348
6350
6351
6353
6354
6356
6357
6358
6359
6360
6361
6362
6363
6364
6365
6367
6368
6369
6370
6372
6373
6375
6376
6377
6378
6379
6380
6382
6383
6384
6385
6386
6388
6389
6391
6392
6393
6394
6395
6396
6397
6398
6399
6400
6401
6406
6408
6409
6412
6413
6414
6417
6418
6424
6426
6427
6428
6429
6430
6431
6432
6433
6436
6437
6439
6440
6441
6442
6443
6444
6445
6446
6447
6448
6449
6451
6453
6454
6455
6456
6458
6459
6460
6462
6464
6465
6466
6470
6471
6472
6473
6474
6475
6476
6477
6478
6479
6480
6481
6482
6483
6485
6486
6489
6491
6493
6494
6495
6497
6498
6499
6502
6503
6504
6505
6506
6507
6508
6509
6510
6511
6512
6514
6515
6516
6517
6518
6519
6520
6521
6522
6523
6526
6527
6528
6529
6530
6533
6534
6535
6536
6539
6540
6544
6545
6547
6549
6550
6551
6553
6556
6557
6558
6559
6562
6564
6565
6567
6568
6569
6570
6571
6572
6573
6574
6579
6580
6581
6582
6584
6585
6586
6588
6589
6591
6592
6594
6595
6596
6597
6598
6599
6600
6601
6602
6603
6604
6606
6608
6609
6610
6611
6616
6617
6619
6620
6621
6622
6623
6625
6626
6629
6630
6631
6632
6633
6635
6636
6637
6640
6641
6642
6645
6646
6647
6648
6649
6651
6652
6653
6654
6656
6657
6659
6661
6662
6663
6665
6666
6667
6668
6669
6672
6673
6674
6675
6676
6677
6680
6681
6682
6686
6687
6688
6689
6690
6691
6694
6697
6698
6699
6701
6703
6704
6706
6707
6708
6709
6710
6713
6714
6715
6716
6717
6718
6719
6720
6721
6722
6723
6724
6726
6727
6728
6731
6732
6733
6734
6737
6742
6743
6744
6747
6750
6753
6759
6760
6762
6763
6764
6765
6767
6772
6774
6775
6777
6779
6780
6781
6782
6784
6786
6787
6788
6789
6790
6791
6792
6793
6794
6795
6797
6798
6799
6800
6801
6802
6805
6806
6807
6808
6809
6812
6813
6814
6817
6819
6820
6821
6822
6824
6827
6829
6830
6832
6833
6834
6835
6836
6837
6838
6839
6842
6844
6845
6846
6848
6849
6850
6851
6852
6853
6854
6855
6858
6860
6861
6862
6863
6864
6866
6867
6868
6869
6870
6871
6872
6873
6874
6876
6877
6878
6879
6881
6882
6883
6884
6886
6887
6888
6891
6892
6894
6896
6897
6898
6900
6901
6902
6903
6904
6905
6907
6908
6909
6910
6911
6912
6913
6914
6915
6916
6917
6918
6919
6921
6922
6924
6925
6926
6928
6929
6931
6933
6934
6935
6936
6939
6940
6941
6942
6943
6944
6945
6948
6949
6950
6951
6952
6953
6957
6958
6959
6960
6964
6966
6968
6970
6971
6972
6973
6974
6975
6976
6977
6979
6980
6982
6983
6984
6986
6987
6989
6991
6992
6993
6994
6995
6996
6997
6998
7001
7002
7005
7006
7007
7009
7010
7011
7012
7013
7015
7019
7020
7022
7023
7024
7025
7026
7027
7029
7033
7036
7039
7040
7042
7043
7044
7045
7048
7050
7051
7052
7054
7057
7058
7059
7061
7063
7064
7066
7067
7068
7069
7070
7071
7072
7074
7077
7078
7083
7084
7085
7086
7087
7088
7089
7094
7096
7097
7098
7099
7100
7104
7105
7106
7108
7111
7112
7114
7115
7116
7117
7118
7119
7120
7125
7128
7130
7131
7132
7134
7135
7136
7137
7138
7140
7141
7142
7144
7145
7146
7147
7148
7151
7152
7153
7154
7155
7158
7159
7161
7162
7164
7167
7168
7170
7171
7172
7174
7180
7181
7182
7183
7184
7185
7187
7190
7191
7192
7194
7196
7197
7198
7199
7201
7202
7203
7205
7206
7207
7208
7209
7210
7211
7212
7214
7215
7216
7217
7220
7221
7222
7223
7225
7226
7227
7228
7229
7230
7231
7232
7233
7234
7235
7236
7237
7240
7241
7242
7244
7245
7247
7248
7251
7252
7253
7255
7256
7257
7258
7259
7260
7262
7264
7267
7269
7271
7272
7275
7277
7278
7279
7280
7281
7282
7284
7285
7286
7287
7288
7289
7291
7293
7294
7297
7298
7299
7301
7302
7304
7306
7307
7308
7309
7312
7315
7316
7318
7319
7320
7321
7322
7325
7327
7329
7330
7331
7332
7333
7334
7337
7338
7339
7340
7341
7342
7343
7344
7345
7346
7347
7349
7351
7352
7354
7355
7356
7359
7360
7361
7362
7364
7367
7368
7369
7370
7374
7375
7376
7377
7378
7381
7382
7383
7385
7386
7387
7388
7389
7390
7391
7392
7393
7395
7396
7398
7399
7403
7405
7407
7408
7409
7410
7411
7413
7414
7415
7416
7419
7420
7421
7422
7424
7426
7429
7431
7433
7436
7437
7438
7440
7442
7444
7445
7446
7447
7448
7449
7450
7451
7452
7453
7454
7455
7456
7457
7458
7459
7461
7462
7463
7464
7466
7468
7469
7470
7471
7472
7473
7475
7476
7477
7478
7479
7480
7481
7483
7484
7485
7488
7489
7490
7492
7493
7494
7496
7498
7499
7501
7502
7503
7504
7505
7506
7507
7508
7510
7511
7512
7513
7514
7516
7517
7518
7520
7521
7523
7527
7530
7531
7532
7533
7534
7535
7537
7541
7543
7544
7545
7546
7547
7548
7549
7553
7554
7557
7558
7559
7560
7562
7565
7566
7567
7568
7569
7573
7574
7575
7576
7577
7579
7580
7581
7582
7583
7585
7586
7588
7589
7592
7594
7597
7598
7599
7601
7602
7604
7606
7607
7608
7611
7612
7613
7614
7616
7617
7619
7622
7625
7626
7627
7628
7629
7634
7636
7637
7638
7639
7640
7641
7642
7643
7644
7645
7646
7648
7649
7650
7652
7653
7654
7656
7657
7658
7659
7660
7661
7662
7666
7670
7671
7672
7673
7675
7676
7679
7680
7681
7684
7685
7686
7687
7688
7689
7690
7691
7692
7693
7694
7695
7696
7697
7700
7701
7702
7704
7705
7707
7708
7709
7710
7712
7715
7718
7720
7721
7722
7723
7724
7725
7726
7727
7728
7729
7731
7733
7734
7735
7736
7737
7738
7739
7740
7742
7745
7746
7747
7748
7749
7750
7755
7756
7758
7759
7761
7767
7768
7770
7771
7772
7773
7774
7775
7776
7777
7780
7781
7782
7784
7785
7786
7787
7788
7790
7792
7793
7794
7795
7796
7799
7800
7801
7802
7803
7804
7805
7806
7808
7809
7811
7812
7813
7814
7815
7816
7817
7821
7822
7825
7826
7827
7828
7829
7830
7831
7832
7833
7834
7835
7836
7837
7838
7840
7841
7842
7844
7845
7847
7848
7849
7850
7851
7852
7853
7854
7856
7857
7858
7860
7862
7863
7864
7865
7868
7869
7870
7871
7873
7874
7875
7876
7878
7880
7881
7882
7886
7888
7889
7890
7891
7892
7893
7895
7896
7898
7899
7900
7902
7905
7906
7907
7908
7909
7910
7913
7914
7915
7916
7917
7918
7920
7921
7923
7924
7925
7926
7927
7928
7930
7931
7934
7937
7938
7939
7940
7941
7942
7943
7944
7946
7947
7948
7950
7952
7953
7954
7955
7956
7958
7961
7962
7963
7964
7966
7967
7970
7971
7973
7974
7977
7978
7979
7980
7981
7982
7983
7985
7986
7987
7989
7990
7991
7992
7994
7995
7997
7998
8002
8003
8005
8006
8007
8008
8010
8012
8016
8017
8018
8019
8022
8025
8028
8031
8032
8033
8034
8037
8038
8040
8042
8043
8045
8046
8047
8049
8050
8051
8052
8053
8054
8055
8057
8058
8060
8062
8063
8064
8067
8068
8070
8071
8073
8074
8075
8076
8077
8079
8080
8081
8082
8083
8084
8086
8088
8089
8090
8093
8094
8095
8096
8098
8099
8100
8101
8102
8105
8106
8107
8108
8109
8110
8111
8112
8113
8115
8120
8123
8124
8126
8127
8128
8129
8130
8131
8133
8134
8136
8137
8138
8139
8141
8142
8144
8145
8146
8147
8149
8150
8152
8153
8154
8155
8156
8157
8158
8159
8161
8162
8163
8164
8165
8166
8167
8169
8170
8172
8174
8175
8178
8181
8182
8183
8184
8186
8187
8189
8190
8191
8192
8194
8196
8198
8199
8200
8201
8202
8203
8204
8205
8206
8207
8208
8209
8210
8211
8212
8214
8218
8221
8222
8223
8224
8225
8228
8230
8232
8233
8234
8236
8237
8239
8240
8241
8242
8243
8244
8245
8246
8247
8249
8250
8251
8252
8257
8258
8259
8262
8263
8264
8266
8269
8273
8274
8275
8276
8277
8278
8279
8280
8281
8282
8283
8284
8286
8289
8290
8291
8293
8294
8299
8300
8302
8303
8306
8307
8309
8311
8312
8313
8314
8315
8316
8317
8319
8320
8321
8322
8323
8325
8326
8327
8328
8329
8333
8334
8335
8336
8337
8340
8341
8342
8343
8344
8345
8346
8347
8350
8351
8352
8354
8355
8357
8358
8359
8360
8362
8363
8364
8366
8370
8371
8372
8374
8375
8376
8379
8380
8384
8387
8388
8389
8390
8393
8394
8395
8396
8397
8398
8399
8400
8402
8403
8404
8405
8406
8407
8408
8409
8412
8413
8414
8415
8416
8418
8419
8420
8421
8424
8425
8426
8427
8428
8429
8430
8433
8434
8436
8438
8439
8440
8442
8443
8444
8445
8446
8447
8448
8449
8451
8452
8453
8455
8456
8458
8459
8460
8462
8463
8465
8466
8468
8469
8470
8477
8478
8480
8482
8484
8487
8489
8494
8495
8498
8499
8503
8504
8505
8506
8507
8508
8509
8511
8513
8514
8515
8517
8518
8519
8520
8521
8522
8523
8524
8525
8526
8527
8528
8529
8530
8532
8533
8534
8536
8537
8539
8543
8544
8548
8549
8553
8555
8558
8559
8560
8562
8563
8565
8566
8567
8568
8569
8571
8572
8574
8576
8577
8578
8579
8580
8583
8587
8588
8589
8590
8593
8596
8597
8600
8601
8603
8605
8606
8607
8608
8609
8610
8612
8613
8615
8617
8619
8620
8621
8624
8627
8629
8630
8632
8633
8634
8635
8636
8640
8641
8643
8644
8645
8646
8647
8648
8649
8650
8651
8652
8653
8654
8655
8657
8659
8663
8664
8665
8667
8668
8669
8670
8672
8673
8674
8676
8677
8679
8681
8682
8684
8685
8691
8693
8694
8696
8697
8698
8701
8703
8706
8709
8710
8711
8712
8713
8714
8716
8717
8718
8719
8723
8724
8725
8726
8728
8729
8731
8732
8736
8737
8739
8740
8742
8744
8745
8747
8748
8750
8751
8752
8754
8755
8756
8757
8759
8760
8761
8762
8763
8764
8765
8766
8767
8771
8773
8774
8775
8776
8777
8781
8782
8783
8784
8786
8787
8788
8789
8790
8792
8793
8795
8799
8800
8802
8803
8805
8808
8810
8811
8812
8814
8816
8817
8821
8823
8826
8829
8830
8831
8832
8833
8834
8836
8837
8838
8840
8841
8842
8843
8844
8845
8849
8854
8855
8856
8857
8860
8861
8862
8863
8864
8865
8868
8869
8870
8872
8873
8874
8875
8877
8880
8881
8882
8884
8885
8886
8887
8888
8889
8890
8891
8892
8893
8895
8896
8899
8900
8901
8903
8904
8905
8906
8908
8910
8911
8913
8914
8915
8916
8918
8919
8921
8922
8923
8924
8926
8927
8929
8932
8933
8934
8935
8936
8938
8941
8942
8943
8946
8947
8949
8950
8951
8952
8953
8954
8955
8956
8959
8961
8962
8963
8964
8965
8966
8967
8968
8969
8970
8973
8974
8975
8976
8978
8979
8980
8982
8984
8985
8986
8987
8988
8990
8991
8992
8993
8994
8995
8997
8998
8999
9000
9003
9004
9005
9006
9007
9009
9010
9013
9014
9015
9016
9017
9018
9019
9021
9022
9023
9024
9025
9027
9028
9029
9031
9032
9034
9035
9036
9037
9039
9041
9042
9043
9044
9045
9046
9047
9049
9051
9052
9053
9054
9056
9057
9059
9060
9061
9062
9063
9067
9068
9070
9071
9072
9073
9074
9075
9076
9078
9079
9080
9081
9082
9084
9085
9086
9087
9088
9089
9090
9092
9093
9094
9096
9097
9099
9100
9101
9103
9104
9105
9108
9112
9113
9115
9117
9122
9125
9126
9128
9129
9130
9132
9133
9134
9135
9136
9138
9139
9141
9142
9146
9148
9150
9151
9152
9153
9154
9155
9156
9159
9160
9161
9162
9163
9166
9167
9168
9169
9170
9171
9173
9174
9175
9176
9177
9180
9182
9183
9184
9185
9186
9187
9188
9189
9191
9192
9193
9194
9195
9197
9198
9199
9200
9201
9202
9203
9204
9207
9208
9209
9210
9211
9212
9213
9214
9215
9217
9218
9219
9220
9221
9222
9224
9226
9228
9230
9231
9232
9233
9234
9235
9236
9237
9238
9239
9240
9242
9243
9244
9245
9246
9248
9249
9251
9252
9254
9255
9256
9258
9259
9261
9262
9264
9265
9267
9268
9271
9272
9273
9274
9275
9276
9279
9280
9283
9284
9286
9287
9288
9289
9291
9292
9295
9296
9297
9298
9299
9300
9301
9302
9304
9305
9306
9308
9309
9310
9311
9312
9313
9314
9315
9316
9317
9318
9319
9323
9325
9327
9328
9329
9331
9333
9336
9338
9340
9341
9342
9345
9347
9348
9350
9351
9352
9353
9355
9356
9358
9359
9360
9361
9362
9363
9364
9366
9367
9368
9369
9370
9373
9376
9377
9378
9379
9381
9382
9383
9384
9386
9387
9388
9389
9390
9391
9393
9394
9397
9398
9400
9401
9407
9408
9409
9410
9411
9412
9413
9414
9416
9418
9419
9420
9421
9423
9424
9426
9428
9430
9435
9436
9437
9438
9439
9440
9441
9442
9443
9444
9447
9448
9450
9453
9456
9460
9462
9463
9464
9465
9466
9468
9469
9472
9474
9475
9476
9477
9480
9481
9482
9483
9485
9486
9487
9488
9492
9493
9495
9497
9498
9500
9506
9507
9508
9511
9512
9514
9515
9518
9519
9520
9521
9522
9525
9526
9527
9528
9529
9530
9531
9532
9533
9534
9535
9536
9537
9538
9539
9541
9544
9546
9550
9551
9552
9555
9556
9557
9558
9559
9560
9561
9562
9563
9564
9565
9566
9569
9570
9571
9572
9573
9574
9575
9576
9577
9578
9579
9581
9583
9584
9585
9586
9587
9588
9590
9591
9592
9593
9594
9595
9596
9597
9598
9601
9602
9605
9606
9607
9608
9609
9610
9611
9612
9613
9614
9616
9617
9618
9619
9620
9621
9623
9625
9626
9627
9628
9631
9632
9635
9637
9638
9639
9646
9647
9649
9650
9653
9654
9656
9658
9659
9660
9661
9662
9663
9665
9666
9667
9668
9670
9671
9672
9673
9674
9676
9677
9678
9680
9681
9684
9685
9686
9687
9688
9689
9691
9693
9694
9695
9696
9698
9699
9701
9702
9703
9707
9708
9710
9711
9714
9715
9716
9717
9718
9719
9720
9721
9723
9724
9726
9727
9728
9729
9730
9731
9732
9733
9735
9736
9737
9738
9739
9740
9741
9742
9743
9745
9746
9750
9752
9754
9755
9756
9758
9760
9763
9765
9766
9767
9770
9771
9772
9773
9774
9775
9776
9778
9779
9780
9783
9784
9785
9786
9787
9788
9789
9790
9791
9792
9795
9797
9799
9800
9801
9803
9805
9808
9809
9810
9811
9812
9813
9814
9815
9817
9818
9821
9822
9823
9825
9826
9827
9828
9829
9830
9833
9835
9836
9838
9840
9843
9844
9845
9846
9848
9849
9850
9851
9853
9854
9857
9858
9859
9860
9861
9862
9864
9866
9867
9869
9872
9873
9874
9876
9877
9878
9881
9882
9883
9884
9889
9890
9891
9895
9896
9897
9898
9900
9902
9904
9907
9908
9910
9912
9913
9914
9915
9916
9919
9921
9922
9923
9924
9925
9926
9927
9928
9929
9931
9932
9933
9934
9935
9936
9937
9938
9939
9940
9942
9945
9947
9949
9950
9951
9952
9954
9955
9957
9959
9961
9962
9963
9964
9965
9967
9971
9972
9974
9975
9977
9978
9979
9980
9981
9982
9983
9984
9985
9986
9988
9989
9990
9991
9993
9994
9995
9996
9997
9999
10001
10003
10004
10006
10007
10008
10009
10010
10011
10012
10013
10014
10015
10016
10017
10018
10019
10020
10022
10023
10025
10026
10029
10034
10035
10037
10038
10039
10040
10042
10043
10044
10045
10046
10048
10049
10050
10054
10057
10059
10060
10062
10063
10064
10067
10069
10072
10074
10075
10077
10078
10079
10080
10082
10084
10088
10089
10091
10096
10097
10098
10101
10103
10105
10108
10109
10111
10112
10113
10114
10115
10116
10117
10121
10122
10123
10124
10126
10127
10128
10130
10131
10132
10133
10134
10135
10138
10139
10141
10142
10143
10144
10145
10146
10147
10148
10149
10152
10153
10154
10155
10156
10157
10158
10159
10160
10161
10163
10164
10166
10168
10169
10170
10171
10173
10174
10179
10180
10182
10185
10186
10187
10188
10190
10191
10192
10193
10194
10197
10198
10200
10201
10202
10203
10204
10205
10206
10208
10209
10210
10211
10213
10215
10216
10217
10219
10221
10222
10224
10225
10228
10229
10231
10232
10233
10235
10238
10243
10245
10246
10247
10248
10249
10250
10252
10255
10256
10257
10260
10261
10262
10263
10264
10267
10268
10270
10271
10272
10273
10274
10275
10276
10277
10278
10279
10280
10282
10283
10284
10285
10286
10287
10288
10291
10293
10294
10297
10299
10300
10301
10303
10305
10307
10310
10311
10312
10313
10315
10317
10318
10319
10321
10322
10323
10324
10325
10326
10327
10329
10330
10331
10334
10335
10337
10338
10340
10341
10342
10343
10344
10345
10349
10350
10351
10353
10354
10355
10356
10357
10358
10359
10361
10364
10365
10372
10373
10374
10376
10377
10379
10380
10382
10383
10384
10386
10387
10389
10390
10391
10392
10397
10398
10399
10400
10402
10403
10405
10406
10407
10408
10409
10411
10413
10414
10416
10417
10419
10420
10421
10422
10425
10426
10427
10428
10429
10430
10432
10433
10434
10435
10436
10438
10439
10440
10441
10443
10444
10445
10446
10447
10449
10450
10452
10453
10454
10455
10456
10457
10460
10462
10463
10464
10465
10466
10468
10470
10472
10473
10474
10475
10476
10477
10478
10479
10482
10483
10484
10486
10488
10489
10490
10492
10495
10496
10497
10500
10501
10502
10503
10504
10505
10506
10508
10510
10511
10514
10515
10516
10517
10520
10521
10522
10524
10525
10526
10527
10529
10530
10531
10532
10533
10534
10536
10537
10538
10539
10541
10542
10543
10544
10545
10548
10549
10550
10551
10552
10555
10557
10558
10560
10561
10564
10565
10568
10569
10570
10571
10572
10574
10575
10576
10581
10586
10587
10588
10589
10590
10591
10592
10593
10594
10595
10596
10597
10598
10599
10600
10601
10607
10610
10611
10613
10614
10615
10616
10618
10619
10620
10621
10622
10623
10624
10625
10626
10627
10629
10630
10631
10632
10634
10635
10636
10637
10638
10639
10640
10641
10642
10643
10644
10645
10646
10647
10648
10649
10651
10652
10653
10654
10655
10657
10658
10659
10660
10661
10663
10665
10668
10670
10671
10672
10674
10675
10676
10677
10681
10682
10685
10687
10689
10691
10692
10693
10694
10695
10696
10697
10698
10699
10700
10701
10702
10703
10706
10707
10708
10709
10711
10712
10713
10714
10715
10716
10718
10719
10721
10722
10723
10724
10725
10727
10728
10730
10732
10733
10734
10735
10736
10737
10741
10742
10743
10745
10746
10748
10749
10750
10753
10755
10756
10757
10758
10759
10760
10761
10763
10764
10765
10766
10767
10768
10771
10772
10773
10774
10777
10778
10783
10784
10785
10786
10787
10788
10789
10790
10791
10794
10795
10797
10799
10800
10801
10803
10804
10805
10807
10808
10810
10811
10814
10816
10817
10819
10820
10821
10822
10823
10824
10825
10827
10828
10829
10830
10832
10834
10835
10836
10837
10838
10839
10840
10841
10844
10845
10847
10848
10850
10851
10853
10854
10859
10861
10862
10863
10864
10866
10867
10868
10869
10870
10871
10872
10874
10876
10877
10878
10879
10883
10884
10885
10886
10888
10889
10890
10893
10894
10896
10897
10898
10900
10902
10903
10904
10905
10907
10908
10909
10911
10912
10913
10914
10916
10917
10918
10922
10923
10924
10926
10929
10930
10931
10932
10933
10934
10935
10936
10937
10938
10939
10940
10941
10942
10943
10944
10945
10946
10947
10949
10950
10951
10952
10953
10954
10955
10956
10961
10962
10963
10964
10965
10966
10967
10968
10970
10971
10972
10973
10974
10976
10978
10979
10980
10981
10983
10985
10988
10989
10991
10992
10994
10996
10997
10998
11000
11001
11002
11006
11008
11009
11010
11012
11014
11015
11016
11017
11018
11019
11020
11021
11023
11026
11028
11029
11030
11031
11034
11035
11036
11037
11038
11039
11040
11041
11044
11045
11046
11048
11049
11050
11051
11052
11053
11054
11057
11060
11063
11064
11065
11066
11067
11068
11069
11070
11072
11074
11075
11077
11078
11080
11081
11082
11083
11084
11085
11087
11090
11091
11093
11096
11097
11098
11099
11100
11101
11102
11103
11104
11106
11108
11109
11111
11113
11114
11115
11118
11120
11121
11123
11124
11126
11127
11128
11129
11131
11133
11134
11136
11137
11138
11139
11140
11141
11143
11144
11145
11146
11147
11149
11150
11151
11153
11154
11157
11160
11161
11162
11163
11164
11166
11167
11168
11169
11170
11172
11173
11174
11178
11179
11181
11184
11185
11186
11187
11189
11191
11192
11193
11194
11195
11198
11199
11200
11201
11203
11204
11205
11206
11208
11209
11210
11211
11212
11214
11215
11216
11219
11220
11221
11227
11229
11231
11233
11234
11235
11236
11237
11238
11239
11240
11241
11242
11243
11244
11246
11248
11249
11250
11251
11252
11253
11255
11256
11257
11258
11259
11260
11261
11262
11264
11265
11267
11268
11270
11272
11275
11276
11277
11278
11279
11280
11281
11282
11283
11284
11285
11286
11290
11291
11292
11293
11294
11295
11296
11297
11298
11299
11302
11303
11304
11305
11307
11309
11310
11312
11313
11316
11317
11318
11319
11321
11322
11323
11324
11325
11326
11327
11328
11329
11330
11331
11332
11334
11336
11338
11339
11341
11342
11343
11344
11345
11346
11347
11348
11349
11350
11354
11355
11356
11359
11361
11362
11364
11365
11367
11368
11369
11370
11371
11372
11374
11375
11376
11377
11378
11379
11381
11382
11385
11389
11390
11391
11393
11395
11396
11397
11400
11402
11403
11404
11405
11406
11408
11409
11410
11413
11414
11415
11416
11419
11421
11423
11424
11425
11426
11427
11429
11430
11431
11432
11433
11435
11436
11439
11440
11441
11442
11443
11444
11446
11447
11449
11450
11451
11455
11458
11459
11460
11462
11463
11465
11466
11467
11469
11470
11473
11474
11475
11476
11477
11480
11483
11484
11485
11486
11487
11489
11491
11492
11494
11495
11497
11498
11499
11500
11502
11503
11504
11506
11508
11510
11512
11513
11514
11515
11516
11517
11519
11521
11522
11523
11526
11527
11528
11529
11530
11531
11533
11535
11536
11537
11538
11539
11542
11543
11544
11546
11547
11548
11549
11550
11551
11552
11553
11555
11556
11557
11560
11561
11563
11564
11566
11567
11568
11569
11571
11572
11574
11576
11577
11578
11579
11582
11583
11584
11585
11586
11587
11588
11589
11590
11591
11592
11594
11596
11598
11599
11600
11601
11606
11608
11609
11610
11611
11612
11613
11614
11617
11621
11622
11623
11624
11627
11628
11630
11631
11632
11638
11639
11640
11642
11643
11644
11648
11649
11650
11653
11654
11655
11658
11659
11660
11661
11662
11663
11664
11665
11666
11667
11669
11670
11672
11674
11676
11679
11683
11685
11686
11688
11689
11690
11691
11693
11695
11696
11699
11700
11701
11702
11703
11704
11705
11707
11709
11711
11712
11713
11714
11715
11716
11717
11718
11719
11720
11722
11724
11725
11726
11727
11728
11730
11731
11732
11734
11735
11736
11739
11740
11743
11744
11745
11746
11747
11750
11757
11758
11760
11762
11763
11764
11765
11766
11768
11770
11771
11774
11775
11776
11777
11778
11779
11780
11781
11783
11786
11788
11790
11791
11792
11793
11794
11795
11796
11797
11798
11801
11802
11803
11805
11806
11807
11809
11810
11811
11814
11816
11817
11818
11819
11824
11825
11827
11830
11833
11836
11837
11838
11839
11840
11841
11842
11843
11844
11845
11846
11849
11850
11852
11853
11855
11856
11857
11858
11859
11860
11862
11863
11865
11866
11869
11870
11871
11873
11875
11876
11879
11880
11881
11883
11884
11886
11887
11888
11889
11890
11891
11892
11893
11895
11897
11898
11899
11901
11903
11904
11905
11906
11907
11908
11910
11912
11913
11914
11915
11916
11918
11919
11920
11922
11923
11924
11925
11926
11927
11928
11929
11930
11931
11932
11933
11934
11937
11939
11940
11942
11943
11944
11949
11950
11951
11953
11955
11956
11957
11959
11960
11961
11962
11963
11964
11965
11966
11967
11968
11969
11970
11971
11972
11973
11974
11975
11977
11979
11980
11982
11983
11984
11987
11988
11989
11990
11991
11993
11994
11995
11999
12001
12002
12004
12005
12006
12010
12013
12017
12018
12019
12020
12021
12022
12023
12026
12027
12028
12029
12031
12032
12034
12035
12036
12037
12038
12039
12041
12042
12045
12046
12048
12050
12051
12052
12053
12054
12055
12056
12057
12058
12059
12060
12061
12062
12063
12064
12065
12066
12067
12068
12069
12071
12072
12073
12074
12075
12076
12080
12081
12082
12083
12084
12085
12086
12087
12089
12090
12091
12092
12093
12095
12097
12098
12099
12100
12103
12104
12105
12108
12109
12110
12113
12114
12115
12118
12122
12125
12126
12128
12131
12133
12134
12137
12140
12141
12142
12143
12144
12146
12147
12148
12150
12153
12154
12155
12156
12157
12159
12160
12162
12163
12164
12165
12166
12168
12169
12170
12172
12174
12175
12176
12177
12180
12181
12182
12183
12185
12186
12187
12191
12192
12193
12194
12195
12196
12198
12199
12200
12201
12202
12203
12204
12205
12206
12207
12208
12209
12210
12211
12212
12213
12214
12215
12218
12219
12220
12221
12222
12223
12224
12225
12226
12227
12230
12231
12233
12234
12235
12236
12237
12239
12241
12243
12244
12245
12246
12247
12248
12249
12250
12251
12252
12253
12254
12255
12256
12257
12261
12262
12264
12265
12266
12267
12268
12269
12271
12272
12273
12274
12275
12276
12277
12278
12282
12283
12284
12285
12286
12288
12289
12290
12291
12292
12293
12295
12296
12298
12299
12300
12301
12302
12303
12304
12305
12307
12310
12311
12312
12313
12314
12317
12318
12319
12321
12322
12324
12325
12326
12327
12328
12329
12331
12332
12333
12335
12338
12340
12341
12342
12343
12344
12345
12346
12349
12351
12354
12355
12359
12360
12362
12364
12366
12367
12369
12371
12372
12373
12374
12375
12376
12377
12379
12380
12386
12387
12389
12390
12392
12395
12396
12397
12398
12399
12400
12401
12403
12404
12407
12410
12412
12413
12414
12417
12419
12420
12421
12422
12423
12424
12425
12426
12427
12428
12430
12431
12432
12433
12435
12438
12440
12441
12443
12444
12445
12446
12447
12448
12449
12450
12451
12452
12453
12458
12459
12460
12461
12462
12467
12470
12473
12474
12475
12476
12480
12481
12482
12483
12485
12486
12487
12488
12489
12490
12491
12492
12495
12497
12500
12502
12503
12506
12507
12508
12509
12511
12512
12513
12514
12515
12516
12517
12518
12519
12520
12521
12522
12524
12525
12528
12530
12531
12532
12533
12534
12535
12536
12537
12538
12539
12541
12544
12545
12546
12547
12548
12549
12550
12551
12553
12554
12555
12557
12560
12562
12564
12565
12566
12567
12569
12570
12572
12573
12574
12576
12577
12580
12581
12582
12583
12586
12587
12588
12589
12590
12592
12593
12594
12597
12598
12600
12601
12605
12606
12607
12609
12610
12612
12613
12614
12615
12620
12621
12622
12623
12626
12627
12628
12629
12631
12632
12633
12634
12636
12637
12638
12639
12640
12641
12642
12643
12644
12645
12646
12647
12650
12651
12653
12654
12655
12657
12658
12659
12660
12661
12662
12664
12665
12667
12669
12670
12671
12672
12674
12675
12676
12677
12678
12679
12680
12681
12682
12683
12684
12686
12687
12688
12690
12691
12693
12694
12696
12697
12699
12700
12701
12703
12704
12705
12706
12707
12708
12710
12712
12715
12716
12717
12718
12719
12720
12721
12722
12724
12726
12727
12728
12729
12730
12731
12732
12733
12735
12736
12739
12740
12741
12742
12745
12747
12748
12749
12751
12752
12753
12754
12755
12756
12757
12758
12759
12761
12763
12764
12765
12766
12767
12768
12769
12772
12774
12775
12776
12779
12780
12781
12785
12788
12789
12790
12791
12792
12797
12798
12800
12802
12803
12805
12806
12807
12808
12809
12811
12812
12813
12814
12815
12818
12819
12820
12821
12824
12826
12829
12832
12834
12835
12836
12837
12839
12840
12841
12843
12846
12847
12848
12851
12855
12856
12857
12858
12861
12862
12863
12865
12866
12867
12868
12869
12870
12872
12873
12874
12875
12876
12877
12879
12881
12882
12883
12886
12887
12888
12889
12890
12891
12893
12894
12895
12896
12899
12900
12901
12902
12903
12904
12905
12907
12909
12910
12911
12912
12913
12914
12915
12920
12921
12922
12926
12927
12928
12929
12930
12931
12932
12933
12935
12936
12938
12940
12941
12943
12944
12945
12947
12948
12950
12951
12952
12953
12954
12955
12956
12957
12958
12960
12961
12962
12963
12964
12965
12966
12967
12969
12975
12981
12982
12983
12984
12986
12987
12988
12989
12991
12992
12994
12995
12996
12997
12998
12999
13005
13006
13008
13010
13011
13013
13014
13015
13017
13018
13019
13023
13025
13026
13027
13028
13029
13030
13031
13032
13033
13034
13035
13036
13037
13038
13040
13041
13042
13043
13044
13045
13046
13048
13050
13052
13055
13056
13057
13058
13060
13062
13064
13066
13067
13068
13069
13070
13071
13072
13074
13076
13077
13078
13079
13082
13083
13085
13087
13088
13089
13090
13091
13092
13093
13094
13095
13096
13097
13101
13102
13104
13106
13108
13109
13110
13112
13113
13114
13117
13119
13121
13122
13123
13124
13125
13127
13130
13132
13134
13135
13136
13137
13140
13141
13143
13144
13145
13146
13147
13148
13150
13155
13159
13160
13161
13162
13163
13164
13165
13166
13167
13168
13169
13170
13174
13177
13178
13179
13180
13183
13184
13187
13188
13190
13191
13192
13193
13194
13196
13197
13198
13200
13202
13203
13206
13207
13208
13209
13210
13212
13213
13214
13215
13217
13218
13219
13220
13222
13223
13224
13225
13227
13228
13229
13230
13232
13234
13235
13239
13242
13244
13245
13248
13250
13252
13253
13254
13256
13257
13258
13259
13261
13262
13264
13265
13266
13267
13269
13271
13272
13273
13274
13275
13277
13278
13279
13280
13281
13282
13287
13288
13289
13291
13292
13293
13296
13297
13298
13299
13300
13301
13302
13303
13306
13307
13308
13309
13310
13311
13313
13315
13316
13317
13319
13320
13321
13322
13324
13325
13326
13327
13328
13330
13331
13332
13333
13334
13335
13336
13337
13338
13339
13340
13341
13342
13343
13344
13345
13346
13347
13348
13349
13350
13351
13353
13355
13356
13359
13362
13363
13364
13365
13366
13367
13369
13370
13371
13372
13373
13374
13379
13381
13382
13383
13384
13385
13386
13388
13389
13390
13391
13392
13393
13394
13396
13397
13399
13401
13403
13404
13405
13406
13407
13408
13410
13411
13412
13414
13415
13416
13417
13418
13419
13420
13421
13423
13426
13427
13428
13430
13431
13432
13433
13435
13438
13439
13440
13441
13442
13443
13444
13445
13446
13447
13448
13449
13452
13454
13455
13456
13458
13459
13461
13462
13463
13464
13467
13468
13469
13470
13471
13472
13473
13474
13475
13478
13479
13483
13486
13488
13489
13490
13491
13492
13493
13494
13495
13496
13499
13501
13502
13503
13504
13505
13506
13508
13511
13513
13514
13515
13516
13517
13520
13521
13523
13525
13527
13529
13530
13531
13532
13534
13535
13536
13537
13538
13539
13541
13542
13543
13544
13546
13548
13553
13554
13556
13557
13558
13559
13560
13561
13562
13565
13566
13567
13568
13569
13570
13572
13573
13574
13575
13576
13577
13578
13580
13581
13587
13588
13589
13590
13594
13595
13596
13597
13598
13599
13600
13602
13603
13604
13605
13607
13610
13611
13612
13613
13614
13616
13619
13621
13622
13624
13625
13627
13628
13629
13630
13634
13635
13636
13638
13640
13641
13645
13647
13649
13650
13651
13652
13653
13654
13656
13657
13658
13659
13660
13662
13663
13664
13665
13666
13667
13670
13674
13675
13678
13679
13680
13681
13682
13684
13685
13686
13687
13688
13689
13690
13693
13694
13695
13697
13700
13701
13702
13707
13709
13710
13711
13712
13716
13718
13719
13720
13721
13722
13727
13728
13730
13731
13734
13735
13736
13737
13738
13742
13743
13744
13746
13747
13748
13752
13756
13761
13762
13763
13764
13765
13766
13767
13768
13769
13771
13772
13773
13775
13777
13778
13780
13781
13783
13784
13785
13786
13788
13789
13790
13791
13794
13797
13798
13799
13802
13804
13805
13806
13807
13808
13809
13810
13811
13812
13813
13814
13815
13817
13818
13819
13820
13821
13823
13824
13826
13827
13828
13829
13830
13831
13832
13834
13835
13838
13839
13842
13843
13844
13845
13846
13847
13851
13852
13853
13854
13856
13857
13859
13860
13861
13866
13867
13868
13869
13872
13873
13875
13876
13878
13879
13881
